home/backend/controllers/AddressController.php

    public function actionAddarea()
    {
        $model = new CategoryDistrict();
        $data=yii::$app->request->post();
        if($data)
        {
            $parentid=$data['parentid'];
            $list=$model->find()->where(['categoryname'=>$parentid])->asArray()->one();
            $data['parentid']=$list['id'];
            $model->setAttributes($data);
            $re=$model->insert();
            if($re)
            {
//                echo $re;die;
                return $this->redirect('?r=address/index');
            }
            else{
                echo "没添加成功";
            }
        }else{
            $id=yii::$app->request->get('id');
            $data=$model->find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `category_district` WHERE `id`='1'