home/backend/controllers/CompanyController.php

    public function actionCompany_jobs_edit(){
        //职业类别
        $category_jobs_parents=Category_jobs::find()->where(['parentid'=>'0'])->asArray()->all();
        $category_jobs=Category_jobs::find()->asArray()->all();
---
SELECT * FROM `category_jobs` WHERE `parentid`=0
SELECT * FROM `category_jobs`