home/backend/controllers/ContentController.php

SELECT * FROM `news_list` INNER JOIN `news_cate` ON news_list.nc_id = news_cate.nc_id ORDER BY `news_id` LIMIT 5
SELECT COUNT(*) FROM `news_list`
---
	public function actionList()
	{
        $limit = 5;
		$query  = new Query();
		$list = $query->from('news_list')->join('INNER JOIN','news_cate','news_list.nc_id = news_cate.nc_id')->limit($limit)->orderby('news_id')->all();
		$list_models = new \app\models\NewsList;
		$page_model=new \app\models\Page();
        $count = $list_models->find()->count(); //总条数