home/backend/controllers/NavigationController.php

    public function actionNavupdate()
    {
        $model = new Navigation();
        $data=yii::$app->request->post();
        $id=yii::$app->request->post('id');
        if($data)
        {
            unset($data['id']);
            $re = $model->updateAll($data,['id'=>$id]);
            if($re)
            {
                return $this->redirect('?r=navigation/index');
            }
            else
            {
                return $this->redirect('?r=navigation/index');
            }
        }else{
            $id=yii::$app->request->get('id');
            $info=$model->find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `navigation` WHERE `id`='1'