home/backend/controllers/RbacController.php

SELECT * FROM `admin` INNER JOIN `arole` ON arole.r_id = admin.r_id
---
	public function actionAdmin()
	{
		$query = new Query();
		$admin_list = $query->from("admin")->join('INNER JOIN','arole','arole.r_id = admin.r_id')->all();