home/frontend/controllers/CompanyController.php

SELECT * FROM `category` WHERE `c_alias`='QS_wage'
SELECT * FROM `category` WHERE `c_alias`='QS_education'
SELECT * FROM `category` WHERE `c_alias`='QS_experience'
SELECT * FROM `category` WHERE `c_alias`='QS_jobtag'
SELECT * FROM `company_profile` WHERE `uid`='30'
SELECT * FROM `category_jobs` WHERE `parentid`='0'
SELECT * FROM `category_jobs`
SELECT * FROM `category_district` WHERE `parentid`='0'
SELECT * FROM `category_district`
---
    public function actionCreate()
    {
        //用户id
        $uid=Yii::$app->session->get('uid');
        //薪资
        $wage_cn=Category::find()->where(['c_alias'=>'QS_wage'])->asArray()->all();
        //学历
        $education_cn=Category::find()->where(['c_alias'=>'QS_education'])->asArray()->all();
        //工作经验
        $experience_cn=Category::find()->where(['c_alias'=>'QS_experience'])->asArray()->all();
        //职业亮点
        $redstar=Category::find()->where(['c_alias'=>'QS_jobtag'])->asArray()->all();
        //联系方式也是用与和jobs_contact表连接数据
        $company_profile=Company_profile::find()->where(['uid'=>"$uid"])->asArray()->all();
//        print_r($company_profile[0]);die;
        //职业类别
        $category_jobs_parents=Category_jobs::find()->where(['parentid'=>'0'])->asArray()->all();
        $category_jobs=Category_jobs::find()->asArray()->all();
        //城市
        $category_one=Category_district::find()->where(['parentid'=>'0'])->asArray()->all();
        $category_district=Category_district::find()->asArray()->all();

SELECT * FROM `color`
---
    public function actionJobs(){
        $uid=Yii::$app->session->get('uid');
        $jobs=Jobs::find()->where(['uid'=>$uid])->asArray()->all();
        $color=Color::find()->asArray()->all();

SELECT * FROM `members` WHERE `uid`='30'
SELECT * FROM `company_profile` WHERE `uid`='30'
---
	public function actionMyhome()
	{
        $uid=Yii::$app->session->get('uid');
        $members=Members::find()->where(['uid'=>$uid])->asArray()->all();
        $company_profile=Company_profile::find()->where(['uid'=>$uid])->asArray()->all();