home/frontend/controllers/PersonController.php

SELECT * FROM `category` WHERE `c_alias`='QS_education'
SELECT * FROM `category_major` WHERE `parentid`='5'
---
    public function actionMan(){

        //得到学历的一级分类
        $edu=Category::find()->where(['c_alias'=>'QS_education'])->asArray()->all();
        //得到专业的大分类
        $major=Category_major::find()->where(['parentid'=>'0'])->asArray()->all();

SELECT * FROM `members_info` WHERE `uid`='31'
---
    public function actionResume_creat(){
        //接收表单中的值，通过uid得到用户的基础数据，然后一起入库
        $data=$_POST;
       // print_r($data);die;
        $uid=Yii::$app->session->get('uid');
        $arr=Members_info::find()->where(['uid'=>$uid])->asArray()->one();