home/frontend/controllers/PersonController.php

SELECT * FROM `resume` WHERE `uid`='31'
---
	public function actionResume_list()
	{
        $uid=Yii::$app->session->get('uid');
        $resume=Resume::find()->where(['uid'=>$uid])->asArray()->all();